Amiya200/stm32_water_tank/Core/Src/model_handle.c
static void check_max_run(void)
{
    if (sys.maxrun_min == 0 || !Motor_GetStatus()) return;
    if (countdownActive || restartActive) return;
    uint32_t limit = (uint32_t)sys.maxrun_min * 60000UL;
    if ((HAL_GetTick() - motorOnStartMs) >= limit)
    {
        senseMaxRunReached = true;
        clear_all_modes();
        stop_motor();
        dryState = DRY_IDLE;
        ModelHandle_SaveModeState();
    }
}

void ModelHandle_Button4_SinglePress(void)
{
    if (!countdownActive)
    {
        clear_all_modes();
        countdownActive  = true;
        countdownMode    = true;
        motorOwner       = MOTOR_OWNER_COUNTDOWN;
        uint32_t defaultSeconds = 600;
        cd_deadline       = HAL_GetTick() + defaultSeconds * 1000UL;
        countdownDuration = defaultSeconds;
        cdTankFullHold    = false;
        dryState          = DRY_IDLE;
        start_motor();
    }
    else
    {
        ModelHandle_StopCountdown();
    }
    ModelHandle_SaveModeState();
}

void ModelHandle_CheckDryRun(void)
{
    float v = adcData.voltages[5];
    senseDryRun = (v < 0.30f);
}

#define GROUND_SENSE_DELAY_MS 10000UL

void ModelHandle_CheckGroundWater(void)
{
    static uint32_t detectStart = 0;
    static bool     stableState = false;

    float    v        = adcData.voltages[4];
    bool     detected = (v < 0.30f);
    uint32_t now      = HAL_GetTick();

    if (detected)
    {
        if (!stableState)
        {
            if (detectStart == 0) detectStart = now;
            if ((now - detectStart) >= GROUND_SENSE_DELAY_MS)
                stableState = true;
        }
    }
    else
    {
        /*
         * Ground water lost: clear stable state so next detection
         * must stabilise again — but we do NOT stop the motor here.
         * Motor control on ground-water loss is handled inside auto_tick()
         * by transitioning to the dry-run test cycle instead of stopping.
         */
        detectStart = 0;
        stableState = false;
    }
    groundWater = stableState;
}

static inline bool isAnyModeActive(void)
{
    return (manualActive || semiAutoActive || countdownActive ||
            twistActive || timerActive || autoActive);
}

void ModelHandle_SoftDryRunHandler(void)
{
    if (!dry_protection_enabled()) { dryState = DRY_IDLE; return; }
    if (motorOwner == MOTOR_OWNER_TIMER || motorOwner == MOTOR_OWNER_AUTO) return;
    if (motorOwner == MOTOR_OWNER_MANUAL || motorOwner == MOTOR_OWNER_NONE)
        { dryState = DRY_IDLE; return; }
    uint32_t now   = HAL_GetTick();
    uint32_t gapMs = (uint32_t)sys.gap_time_s * 1000UL;
    ModelHandle_CheckDryRun();
    bool motorOn = Motor_GetStatus();

    if (motorOn)
    {
        switch (dryState)
        {
            case DRY_IDLE:
                if (!senseDryRun) { dryState = DRY_WAITING; dryDeadline = now + gapMs; }
                break;

            case DRY_WAITING:
                if ((int32_t)(now - dryDeadline) < 0) break;
                if (!senseDryRun)
                {
                    stop_motor();
                    dryState = DRY_FAULT;
                    if (buzzerSettings.tankEmptySound) Buzzer_StartEvent(BUZZ_TANK_EMPTY);

                    switch (motorOwner)
                    {
                        case MOTOR_OWNER_SEMIAUTO:
                            semiAutoActive = false; motorOwner = MOTOR_OWNER_NONE;
                            ModelHandle_SaveModeState(); break;
                        case MOTOR_OWNER_COUNTDOWN:
                            ModelHandle_StopCountdown(); break;
                        case MOTOR_OWNER_TWIST:
                            ModelHandle_StopTwist(); break;
                        case MOTOR_OWNER_RESTART:
                            restartActive = false; motorOwner = MOTOR_OWNER_NONE;
                            restore_previous_mode(); ModelHandle_SaveModeState(); break;
                        default: break;
                    }
                }
                else dryState = DRY_IDLE;
                break;
            case DRY_FAULT:
                stop_motor(); break;

            default:
                dryState = DRY_IDLE; break;
        }
    }
    else
    {
        switch (dryState)
        {
            case DRY_FAULT:    if (senseDryRun) dryState = DRY_IDLE; break;
            case DRY_WAITING:  dryState = DRY_IDLE; break;
            default:           dryState = DRY_IDLE; break;
        }
    }
}

static inline uint32_t get_load_lock_duration_ms(void)
{
    return (sys.retry_count == 0) ? LOAD_LOCK_DEFAULT_MS
                                  : (uint32_t)sys.retry_count * 60000UL;
}

void ModelHandle_CheckLoadFault(void)
{
    if (!Motor_GetStatus()) return;
    float I = g_currentA;
    float V = g_voltageV;
    bool overload  = (sys.overload  > 0.1f)   && (I > sys.overload);
    bool underload = (sys.underload > 0.001f) && (I < sys.underload);
    bool voltFault = ((sys.uv_limit && V < sys.uv_limit) ||
                      (sys.ov_limit && V > sys.ov_limit));
    senseOverLoad      = overload;
    senseUnderLoad     = underload;
    senseOverUnderVolt = voltFault;
    bool fault = overload || underload || voltFault;

    uint32_t now    = HAL_GetTick();
    uint32_t lockMs = get_load_lock_duration_ms();

    switch (loadState)
    {
        case LOAD_NORMAL:
            loadRetryCount = 0;
            if (fault) { loadState = LOAD_FAULT_WAIT; loadTimer = now; }
            break;
        case LOAD_FAULT_WAIT:
            if (!fault) { loadState = LOAD_NORMAL; }
            else if ((now - loadTimer) >= LOAD_FAULT_CONFIRM_MS)
            {
                stop_motor(); loadState = LOAD_FAULT_LOCK; loadTimer = now;
                if (buzzerSettings.tankFullSound) Buzzer_StartEvent(BUZZ_TANK_FULL);
            }
            break;
        case LOAD_FAULT_LOCK:
            if (!fault) { loadState = LOAD_NORMAL; }
            else if ((now - loadTimer) >= lockMs && loadRetryCount < 1)
            {
                loadRetryCount++;
                if (isAnyModeActive()) start_motor();
                loadState = LOAD_RETRY_RUN; loadTimer = now;
            }
            break;
        case LOAD_RETRY_RUN:
            if ((now - loadTimer) >= LOAD_RETRY_RUN_MS)
            {
                if (fault)
                {
                    stop_motor(); loadState = LOAD_FAULT_LOCK; loadTimer = now;
                    if (buzzerSettings.tankFullSound) Buzzer_StartEvent(BUZZ_TANK_FULL);
                }
                else { loadState = LOAD_NORMAL; loadRetryCount = 0; }
            }
            break;
    }
}

static uint8_t get_today_mask(void)
{
    uint8_t d = time.dow;
    if (d < 1 || d > 7) d = 1;
    return (1U << (d - 1));
}

static bool slot_is_active_now(const TimerSlot *t)
{
    if (!t->enabled) return false;
    if (!(t->dayMask & get_today_mask())) return false;
    uint16_t now = time.hour * 60 + time.min;
    uint16_t on  = t->onHour  * 60 + t->onMinute;
    uint16_t off = t->offHour * 60 + t->offMinute;
    if (on == off) return false;
    if (on < off)  return (now >= on && now < off);
    return (now >= on || now < off);
}

static bool timer_any_active_slot(void)
{
    for (int i = 0; i < 5; i++)
        if (slot_is_active_now(&timerSlots[i])) return true;
    return false;
}

static uint16_t get_active_timer_gap_minutes(void)
{
    if (!timerActive) return 0;
    uint16_t now = time.hour * 60 + time.min;
    uint8_t dm = get_today_mask();
    for (int i = 0; i < 5; i++)
    {
        TimerSlot *t = &timerSlots[i];
        if (!t->enabled || !(t->dayMask & dm)) continue;
        uint16_t on  = t->onHour * 60 + t->onMinute;
        uint16_t off = t->offHour * 60 + t->offMinute;
        bool active = (on < off) ? (now >= on && now < off) : (now >= on || now < off);
        if (active) return (uint16_t)(sys.gap_time_s / 60);
    }
    return 0;
}

void ModelHandle_SaveBuzzerSettings(void)
{
    EEPROM_WriteBuffer(EE_ADDR_BUZZER_BLOCK, (uint8_t*)&buzzerSettings, sizeof(buzzerSettings));
}

void ModelHandle_LoadBuzzerSettings(void)
{
    EEPROM_ReadBuffer(EE_ADDR_BUZZER_BLOCK, (uint8_t*)&buzzerSettings, sizeof(buzzerSettings));
    if (buzzerSettings.pumpOnSound   > 1) buzzerSettings.pumpOnSound   = 1;
    if (buzzerSettings.tankFullSound  > 1) buzzerSettings.tankFullSound  = 1;
    if (buzzerSettings.tankEmptySound > 1) buzzerSettings.tankEmptySound = 1;
}

void ModelHandle_ProcessTimerSlots(void)
{
    if (!timerActive) return;

    /* Timer is subordinate to AUTO mode - if auto stops, timer stops too */
    if (!autoActive)
    {
        timerActive        = false;
        timerStateDeadline = 0;
        dryState           = DRY_IDLE;
        stop_motor();
        return;
    }

    if (motorOwner != MOTOR_OWNER_TIMER &&
        motorOwner != MOTOR_OWNER_AUTO  &&
        motorOwner != MOTOR_OWNER_NONE)
    {
        return;
    }
    uint32_t now        = HAL_GetTick();
    bool     slotActive = timer_any_active_slot();
    if (!slotActive)
    {
        stop_motor();
        dryState = DRY_IDLE;
        timerState = TIMER_RUN_TEST;
        timerStateDeadline = 0;
        return;
    }
    if (isTankFull())
    {
        stop_motor();
        timerState = TIMER_RUN_TEST;
        timerStateDeadline = 0;
        dryState = DRY_IDLE;
        return;
    }
    if (senseOverLoad || senseUnderLoad || senseOverUnderVolt || senseMaxRunReached)
    {
        stop_motor();
        return;
    }
    if (!dry_protection_enabled())
    {
        motorOwner         = MOTOR_OWNER_TIMER;
        timerState         = TIMER_RUN_CONTINUOUS;
        timerStateDeadline = 0;
        dryState           = DRY_IDLE;
        start_motor();
        return;
    }
    uint32_t dryTestMs  = (uint32_t)sys.gap_time_s     * 1000UL;
    uint32_t retryGapMs = (uint32_t)sys.dry_run_time_s * 1000UL;
    ModelHandle_CheckDryRun();
    switch (timerState)
    {
        case TIMER_RUN_TEST:
            motorOwner = MOTOR_OWNER_TIMER;
            start_motor();
            dryState = DRY_WAITING;
            if (timerStateDeadline == 0) timerStateDeadline = now + dryTestMs;
            if (now >= timerStateDeadline)
            {
                if (!senseDryRun)
                {
                    stop_motor();
                    timerState         = TIMER_WAIT_RETRY;
                    timerStateDeadline = now + retryGapMs;
                    dryState           = DRY_FAULT;
                }
                else
                {
                    timerState = TIMER_RUN_CONTINUOUS;
                    dryState   = DRY_IDLE;
                }
            }
            break;
        case TIMER_WAIT_RETRY:
            dryState = DRY_FAULT;
            if (now >= timerStateDeadline)
            {
                timerState         = TIMER_RUN_TEST;
                timerStateDeadline = 0;
            }
            break;
        case TIMER_RUN_CONTINUOUS:
            start_motor();
            dryState = DRY_IDLE;
            if (!senseDryRun)
            {
                stop_motor();
                timerState         = TIMER_WAIT_RETRY;
                timerStateDeadline = now + retryGapMs;
                dryState           = DRY_FAULT;
            }
            break;
    }
}

void ModelHandle_StartTimer(void)
{
    ModelHandle_SaveTimerToEEPROM();
    ModelHandle_SendTimerInfoUART();
}

