Amiya200/stm32_water_tank/Core/Src/model_handle.c
void ModelHandle_StopTimer(void)
{
    timerActive        = false;
    timerStateDeadline = 0;
    dryState           = DRY_IDLE;
    /* If in auto mode, return ownership to auto */
    if (autoActive)
        motorOwner = MOTOR_OWNER_AUTO;
    else
        stop_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_CheckAutoTimerActivation(void)
{
    /* Timer auto-activation only when auto mode is running */
    if (!autoActive) return;
    if (timerActive) return;
    if (timer_any_active_slot())
    {
        timerActive = true;
        motorOwner  = MOTOR_OWNER_TIMER;
        timerState  = TIMER_RUN_TEST;
        timerStateDeadline = 0;
        start_motor();
    }
}

void ModelHandle_StartSemiAuto(void)
{
    restartActive = false;
    clear_all_modes();
    semiAutoActive       = true;
    motorOwner           = MOTOR_OWNER_SEMIAUTO;
    semiState            = SEMI_RUN_TEST;
    semiDeadline         = 0;
    semiWaterLossPending = false;
    senseMaxRunReached   = false;
    semiTankFullHold     = false;
    dryState             = DRY_IDLE;
    start_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive   = false;
    semiTankFullHold = false;
    dryState         = DRY_IDLE;
    stop_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_StartAuto(uint16_t gap_s, uint16_t maxrun_min, uint8_t retry)
{
    clear_all_modes();
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;
    autoUserLocked   = false;
    autoActive       = true;
    autoState        = AUTO_ON_WAIT;
    stateDeadline    = 0;
    motorOwner       = MOTOR_OWNER_AUTO;
    dryState         = DRY_IDLE;
    /* Check if there's a timer slot active right now */
    if (timer_any_active_slot())
    {
        timerActive        = true;
        timerState         = TIMER_RUN_TEST;
        timerStateDeadline = 0;
        motorOwner         = MOTOR_OWNER_TIMER;
    }
    ModelHandle_SaveModeState();
}

void ModelHandle_StopAuto(void)
{
    /* Stopping auto also stops timer (timer is subordinate to auto) */
    timerActive        = false;
    timerStateDeadline = 0;
    stop_motor();
    autoActive       = false;
    autoState        = AUTO_IDLE;
    stateDeadline    = 0;
    auto_retry_count = 0;
    autoDeadline     = 0;
    dryState         = DRY_IDLE;
    ModelHandle_SaveModeState();
}

void ModelHandle_LoadAutoSettings(void)
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s,       sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min,  sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));

    if (auto_gap_s < 30 || auto_gap_s > 3600)
        { auto_gap_s = 120; EEPROM_WriteBlockSafe(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s)); }
    if (auto_maxrun_min == 0xFFFF || auto_maxrun_min > 600)
        { auto_maxrun_min = 30; EEPROM_WriteBlockSafe(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min)); }
    if (auto_retry_limit == 0xFF || auto_retry_limit > 20)
        { auto_retry_limit = 3; EEPROM_WriteBlockSafe(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit)); }
}

/* -------------------------------------------------------------------------
 * auto_mode_background_control:
 *   Decides whether to START auto mode based on tank level and ground water.
 *   Ground water is only checked at STARTUP of auto (before motor runs).
 *   Once auto is running, ground water absence does NOT stop the motor —
 *   it transitions to the dry-run test cycle instead (handled in auto_tick).
 * -------------------------------------------------------------------------*/
static void auto_mode_background_control(void)
{
    if (!autoBackgroundEnabled) return;
    if (autoUserLocked) return;
    uint32_t now = HAL_GetTick();
    if (now < autoBootIgnoreUntil) return;
    if (now < bootBlockUntil) return;
    if (manualActive || semiAutoActive || timerActive || countdownActive || twistActive) return;

    /* Ground water must be present before AUTO mode starts for the first time */
    ModelHandle_CheckGroundWater();
    uint8_t level = get_tank_level_percent();
    if (!autoActive &&
        level <= AUTO_START_LEVEL_PERCENT &&
        groundWater &&
        powerRestoreMode != 1)
    {
        ModelHandle_StartAuto(sys.gap_time_s, auto_maxrun_min, auto_retry_limit);
        return;
    }
    if (autoActive && level >= AUTO_STOP_LEVEL_PERCENT)
    {
        stop_motor();
        autoState     = AUTO_ON_WAIT;
        stateDeadline = 0;
        dryState      = DRY_IDLE;
        ModelHandle_SaveModeState();
    }
}

void ModelHandle_SetBuzzerSettings(uint8_t pump, uint8_t full, uint8_t empty)
{
    buzzerSettings.pumpOnSound    = pump  ? 1 : 0;
    buzzerSettings.tankFullSound  = full  ? 1 : 0;
    buzzerSettings.tankEmptySound = empty ? 1 : 0;
    ModelHandle_SaveBuzzerSettings();
}

/* -------------------------------------------------------------------------
 * auto_tick:
 *
 *   Ground water behaviour (UPDATED):
 *   ─────────────────────────────────
 *   • AUTO_ON_WAIT  : ground water IS checked. If absent, motor is not
 *                     started yet — we wait until it appears.
 *   • AUTO_OFF_WAIT : motor is running. If ground water is lost we do NOT
 *                     stop the motor. Instead we immediately transition to
 *                     AUTO_DRY_CHECK (dry-run test cycle) so the dry-run
 *                     logic decides whether the motor should keep running.
 *   • AUTO_DRY_CHECK: just waits for the retry gap, no ground water check.
 *
 *   Rationale: losing ground-water signal while the pump is running may be
 *   a transient sensor glitch or the pump drawing down the source. The
 *   dry-run sensor (voltages[5]) is the authoritative water-presence test.
 *   Ground water is only an enabling condition to START the pump, not to
 *   keep it running.
 * -------------------------------------------------------------------------*/
static void auto_tick(void)
{
    if (!autoActive) return;
    uint32_t now = HAL_GetTick();
    ModelHandle_CheckDryRun();
    uint8_t level = get_tank_level_percent();
    bool protectionFault = senseOverLoad || senseUnderLoad || senseOverUnderVolt || senseMaxRunReached;
    if (protectionFault) { stop_motor(); autoState = AUTO_IDLE; stateDeadline = 0; return; }

