Amiya200/stm32_water_tank/Core/Src/model_handle.c
    if (level >= AUTO_STOP_LEVEL_PERCENT)
    {
        stop_motor(); autoState = AUTO_ON_WAIT; stateDeadline = 0; dryState = DRY_IDLE;
        return;
    }

    if (!dry_protection_enabled())
    {
        /* ── No dry-run protection path ── */
        if (autoState == AUTO_IDLE || autoState == AUTO_DRY_CHECK)
            autoState = AUTO_ON_WAIT;

        if (autoState == AUTO_ON_WAIT)
        {
            if (!Motor_GetStatus() && level > AUTO_START_LEVEL_PERCENT) return;
            /* Check ground water only to decide whether to START the motor */
            ModelHandle_CheckGroundWater();
            if (!groundWater) return;   /* wait for ground water to start */
            motorOwner    = MOTOR_OWNER_AUTO;
            autoState     = AUTO_OFF_WAIT;
            stateDeadline = 0;
            dryState      = DRY_IDLE;
            start_motor();
            return;
        }
        if (autoState == AUTO_OFF_WAIT)
        {
            /*
             * Motor is running.
             * Ground water loss does NOT stop the motor — transition to
             * dry-run test so the dry-run sensor decides.
             */
            ModelHandle_CheckGroundWater();
            if (!groundWater)
            {
                /*
                 * No ground water while running: enter dry-check cycle.
                 * The motor keeps running through the test period; if
                 * dry-run sensor also shows no water it will fault out.
                 * If dry-run sensor shows water we return to OFF_WAIT.
                 */
                autoState     = AUTO_DRY_CHECK;
                stateDeadline = now + (uint32_t)sys.gap_time_s * 1000UL;
                /* keep motor running — dry-run handler takes over */
                dryState = DRY_WAITING;
                return;
            }
            dryState = DRY_IDLE;
            start_motor();
            return;
        }
        /* AUTO_DRY_CHECK without dry protection: just go back to ON_WAIT */
        autoState = AUTO_ON_WAIT; stateDeadline = 0;
        return;
    }

    /* ── Dry-run protection enabled path ── */
    uint32_t dryTestMs  = (uint32_t)sys.gap_time_s     * 1000UL;
    uint32_t retryGapMs = (uint32_t)sys.dry_run_time_s * 1000UL;

    switch (autoState)
    {
        case AUTO_ON_WAIT:
            if (stateDeadline == 0)
            {
                if (level > AUTO_START_LEVEL_PERCENT) break;
                /* Ground water check: only when starting */
                ModelHandle_CheckGroundWater();
                if (!groundWater) break;   /* wait — but do NOT stop motor */
                motorOwner    = MOTOR_OWNER_AUTO;
                start_motor();
                stateDeadline = now + dryTestMs;
                break;
            }
            if ((int32_t)(now - stateDeadline) < 0) break;
            if (senseDryRun)
                { autoState = AUTO_OFF_WAIT; stateDeadline = 0; }
            else
                { stop_motor(); autoState = AUTO_DRY_CHECK; stateDeadline = now + retryGapMs; }
            break;

        case AUTO_DRY_CHECK:
            /* Waiting in retry gap — no ground water re-check, just wait */
            if (now >= stateDeadline) { autoState = AUTO_ON_WAIT; stateDeadline = 0; }
            break;

        case AUTO_OFF_WAIT:
            /*
             * Motor is running.
             * Ground water loss does NOT stop the motor.
             * Instead, transition to dry-run test cycle so the dry-run
             * sensor is the authoritative check.
             */
            ModelHandle_CheckGroundWater();
            if (!groundWater)
            {
                /*
                 * Ground water gone while running: switch to DRY_CHECK
                 * cycle. Motor keeps running; dry-run sensor will fault
                 * if water is truly absent.
                 */
                stop_motor();
                autoState     = AUTO_DRY_CHECK;
                stateDeadline = now + retryGapMs;
                dryState      = DRY_FAULT;   /* mark so display shows DRY */
                break;
            }
            start_motor();
            if (!senseDryRun)
            {
                stop_motor();
                autoState     = AUTO_DRY_CHECK;
                stateDeadline = now + retryGapMs;
                dryState      = DRY_FAULT;
            }
            else
            {
                dryState = DRY_IDLE;
            }
            break;

        default:
            autoState = AUTO_IDLE; stateDeadline = 0; break;
    }
}

void ModelHandle_StartCountdown(uint32_t seconds)
{
    if (seconds < 60)    seconds = 60;
    if (seconds > 10800) seconds = 10800;
    clear_all_modes();
    senseMaxRunReached = false;
    countdownActive    = true;
    countdownMode      = true;
    uint32_t now       = HAL_GetTick();
    cd_deadline        = now + (seconds * 1000UL);
    countdownDuration  = seconds;
    motorOwner         = MOTOR_OWNER_COUNTDOWN;
    cdTankFullHold     = false;
    dryState           = DRY_IDLE;
    start_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_StopCountdown(void)
{
    countdownActive   = false;
    countdownMode     = false;
    cd_deadline       = 0;
    countdownDuration = 0;
    cdTankFullHold    = false;
    dryState          = DRY_IDLE;
    stop_motor();
    ModelHandle_SaveModeState();
}

static uint16_t CD_CRC(const uint8_t* d, uint16_t l)
{
    uint16_t c = 0xFFFF;
    while (l--) c = (c >> 1) ^ (*d++ + 0xA001);
    return c;
}

static void SaveCountdown(void)
{
    CountdownBlock b;
    memset(&b, 0, sizeof(b));
    b.sig    = CD_SIGNATURE;
    b.active = countdownActive;
    if (countdownActive)
    {
        uint32_t now = now_ms();
        b.remaining = (cd_deadline > now) ? (cd_deadline - now) / 1000UL : 0;
    }
    b.crc = CD_CRC((uint8_t*)&b, sizeof(b) - 2);
    EEPROM_WriteBuffer(EE_ADDR_COUNTDOWN_BLOCK, (uint8_t*)&b, sizeof(b));
}

void ModelHandle_LoadCountdown(void)
{
    CountdownBlock b;
    EEPROM_ReadBuffer(EE_ADDR_COUNTDOWN_BLOCK, (uint8_t*)&b, sizeof(b));
    if (b.sig != CD_SIGNATURE) return;
    if (CD_CRC((uint8_t*)&b, sizeof(b) - 2) != b.crc) return;
    if (b.active && b.remaining > 0)
    {
        countdownActive   = true;
        countdownMode     = true;
        countdownDuration = b.remaining;
        cd_deadline       = now_ms() + b.remaining * 1000UL;
        motorOwner        = MOTOR_OWNER_COUNTDOWN;
    }
}

void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s,
                            uint8_t onH, uint8_t onM,
                            uint8_t offH, uint8_t offM)
{
    clear_all_modes();
    uint32_t on_sec  = (on_s  ? on_s  : 1) * 60UL;
    uint32_t off_sec = (off_s ? off_s : 1) * 60UL;
    twistSettings.onDurationSeconds  = on_sec;
    twistSettings.offDurationSeconds = off_sec;
    twistSettings.onHour    = onH;
    twistSettings.onMinute  = onM;
    twistSettings.offHour   = offH;
    twistSettings.offMinute = offM;
    twistSettings.twistArmed  = true;
    twistSettings.twistActive = false;
    twistActive    = true;
    motorOwner     = MOTOR_OWNER_TWIST;
    twist_on_phase = true;
    twist_deadline = now_ms() + on_sec * 1000UL;
    dryState       = DRY_IDLE;
    start_motor();
}

void ModelHandle_StopTwist(void)
{
    twistActive               = false;
    twistSettings.twistActive = false;
    dryState                  = DRY_IDLE;
    stop_motor();
    ModelHandle_SaveModeState();
}

static void twist_tick(void)
{
    if (!twistActive) return;
    if (isTankFull()) { ModelHandle_StopTwist(); if (buzzerSettings.tankFullSound) Buzzer_StartEvent(BUZZ_TANK_FULL); return; }

    uint32_t now = now_ms();
    if (now >= twist_deadline)
    {
        twist_on_phase = !twist_on_phase;
        twist_deadline = now + (twist_on_phase ?
            twistSettings.onDurationSeconds :
            twistSettings.offDurationSeconds) * 1000UL;
    }
    if (twist_on_phase) start_motor(); else stop_motor();
}

static void leds_from_model(void)
{
    LED_ClearAllIntents();
    bool motorOn = Motor_GetStatus();
    if (dryState == DRY_FAULT)
    {
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 400);
        LED_ApplyIntents();
        return;
    }
    if (motorOn)          LED_SetIntent(LED_COLOR_GREEN,  LED_MODE_STEADY, 0);
    if (senseMaxRunReached) LED_SetIntent(LED_COLOR_RED,  LED_MODE_BLINK,  300);
    if (senseOverLoad || senseUnderLoad) LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);
    if (senseOverUnderVolt) LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);
    LED_ApplyIntents();
}

void ModelHandle_Process(void)
{
    uint32_t now = HAL_GetTick();

